{
   "class_name":"Sequential",
   "config":{
      "name":"sequential",
      "layers":[
         {
            "class_name":"Conv2D",
            "config":{
               "name":"conv2d",
               "trainable":true,
               "batch_input_shape":[
                  null,
                  144,
                  296,
                  3
               ],
               "dtype":"float32",
               "filters":32,
               "kernel_size":[
                  3,
                  3
               ],
               "strides":[
                  1,
                  1
               ],
               "padding":"valid",
               "data_format":"channels_last",
               "dilation_rate":[
                  1,
                  1
               ],
               "activation":"linear",
               "use_bias":true,
               "kernel_initializer":{
                  "class_name":"GlorotUniform",
                  "config":{
                     "seed":null,
                     "dtype":"float32"
                  }
               },
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{
                     "dtype":"float32"
                  }
               },
               "kernel_regularizer":null,
               "bias_regularizer":null,
               "activity_regularizer":null,
               "kernel_constraint":null,
               "bias_constraint":null
            }
         },
         {
            "class_name":"Activation",
            "config":{
               "name":"activation",
               "trainable":true,
               "dtype":"float32",
               "activation":"relu"
            }
         },
         {
            "class_name":"MaxPooling2D",
            "config":{
               "name":"max_pooling2d",
               "trainable":true,
               "dtype":"float32",
               "pool_size":[
                  2,
                  2
               ],
               "padding":"valid",
               "strides":[
                  2,
                  2
               ],
               "data_format":"channels_last"
            }
         },
         {
            "class_name":"Conv2D",
            "config":{
               "name":"conv2d_1",
               "trainable":true,
               "dtype":"float32",
               "filters":32,
               "kernel_size":[
                  3,
                  3
               ],
               "strides":[
                  1,
                  1
               ],
               "padding":"valid",
               "data_format":"channels_last",
               "dilation_rate":[
                  1,
                  1
               ],
               "activation":"linear",
               "use_bias":true,
               "kernel_initializer":{
                  "class_name":"GlorotUniform",
                  "config":{
                     "seed":null,
                     "dtype":"float32"
                  }
               },
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{
                     "dtype":"float32"
                  }
               },
               "kernel_regularizer":null,
               "bias_regularizer":null,
               "activity_regularizer":null,
               "kernel_constraint":null,
               "bias_constraint":null
            }
         },
         {
            "class_name":"Activation",
            "config":{
               "name":"activation_1",
               "trainable":true,
               "dtype":"float32",
               "activation":"relu"
            }
         },
         {
            "class_name":"MaxPooling2D",
            "config":{
               "name":"max_pooling2d_1",
               "trainable":true,
               "dtype":"float32",
               "pool_size":[
                  2,
                  2
               ],
               "padding":"valid",
               "strides":[
                  2,
                  2
               ],
               "data_format":"channels_last"
            }
         },
         {
            "class_name":"Conv2D",
            "config":{
               "name":"conv2d_2",
               "trainable":true,
               "dtype":"float32",
               "filters":64,
               "kernel_size":[
                  3,
                  3
               ],
               "strides":[
                  1,
                  1
               ],
               "padding":"valid",
               "data_format":"channels_last",
               "dilation_rate":[
                  1,
                  1
               ],
               "activation":"linear",
               "use_bias":true,
               "kernel_initializer":{
                  "class_name":"GlorotUniform",
                  "config":{
                     "seed":null,
                     "dtype":"float32"
                  }
               },
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{
                     "dtype":"float32"
                  }
               },
               "kernel_regularizer":null,
               "bias_regularizer":null,
               "activity_regularizer":null,
               "kernel_constraint":null,
               "bias_constraint":null
            }
         },
         {
            "class_name":"Activation",
            "config":{
               "name":"activation_2",
               "trainable":true,
               "dtype":"float32",
               "activation":"relu"
            }
         },
         {
            "class_name":"MaxPooling2D",
            "config":{
               "name":"max_pooling2d_2",
               "trainable":true,
               "dtype":"float32",
               "pool_size":[
                  2,
                  2
               ],
               "padding":"valid",
               "strides":[
                  2,
                  2
               ],
               "data_format":"channels_last"
            }
         },
         {
            "class_name":"Flatten",
            "config":{
               "name":"flatten",
               "trainable":true,
               "dtype":"float32",
               "data_format":"channels_last"
            }
         },
         {
            "class_name":"Dense",
            "config":{
               "name":"dense",
               "trainable":true,
               "dtype":"float32",
               "units":64,
               "activation":"linear",
               "use_bias":true,
               "kernel_initializer":{
                  "class_name":"GlorotUniform",
                  "config":{
                     "seed":null,
                     "dtype":"float32"
                  }
               },
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{
                     "dtype":"float32"
                  }
               },
               "kernel_regularizer":null,
               "bias_regularizer":null,
               "activity_regularizer":null,
               "kernel_constraint":null,
               "bias_constraint":null
            }
         },
         {
            "class_name":"Activation",
            "config":{
               "name":"activation_3",
               "trainable":true,
               "dtype":"float32",
               "activation":"relu"
            }
         },
         {
            "class_name":"Dropout",
            "config":{
               "name":"dropout",
               "trainable":true,
               "dtype":"float32",
               "rate":0.5,
               "noise_shape":null,
               "seed":null
            }
         },
         {
            "class_name":"Dense",
            "config":{
               "name":"dense_1",
               "trainable":true,
               "dtype":"float32",
               "units":1,
               "activation":"linear",
               "use_bias":true,
               "kernel_initializer":{
                  "class_name":"GlorotUniform",
                  "config":{
                     "seed":null,
                     "dtype":"float32"
                  }
               },
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{
                     "dtype":"float32"
                  }
               },
               "kernel_regularizer":null,
               "bias_regularizer":null,
               "activity_regularizer":null,
               "kernel_constraint":null,
               "bias_constraint":null
            }
         },
         {
            "class_name":"Activation",
            "config":{
               "name":"activation_4",
               "trainable":true,
               "dtype":"float32",
               "activation":"sigmoid"
            }
         }
      ]
   },
   "keras_version":"2.2.4-tf",
   "backend":"tensorflow"
}
